"""
Нейронные сети
  Свёрточные (конволюционные нейронные сети) [CNN]
      Используются в задачах компьютерного зрения
  Рекурентные нейросети [RNN]
      Распознавание рукописного текста
  Генеративные созтязательные сети
      Создание художественных и музыкальных произведений
  Многослойный перцептон
      Каждый нейрон связан со всеми нейронами из соседних слоёв
      У каждого нейрона есть смещение, а у каждой связи вес, у каждого внутреннего нейрона есть функция активации,
      например функция выпрямления линейных единиц (ReLu) (if x>0, f(x)=x, f(x)=0), где f(x)=x*m+b (m - вес, b - смещение)
"""

